Repository: GlitchedPolygons/GlitchedEpistle.Client.Mobile
Catalog: src/shared/Resources/LocalizedStrings.*.resx
Languages: de, it

# PleaseEnterConvoPassword
source: Please enter the convo password to join.
de: Bitte gib hier unten das Unterhaltungspasswort ein um beizutreten.
it: P.f. inserisci qua sotto la password di partecipazione della conversazione.

# SubmitButton
source: Submit
de: Speichern
it: Salva

# AttachmentLabel
source: Download attachment:
de: Anhang herunterladen:
it: Scarica allegato:

# BannedUsersListLabel
source: Banned users:
de: Verbannte Benutzer:
it: Utenti bannati:

# CantLeaveConvoAsAdminErrorMessage
source: You are the administrator of this convo. In maritime tradition, the captain goes down with his ship. If you really want to leave your own convo, you need to elect a new administrator from the participants list. In this case, not because this is a ship, but because the server's database requires it...
de: Du bist der Administrator dieser Unterhaltung. In maritimer Tradition geht der Kapitän mit seinem Schiff unter. Wenn du diese Unterhaltung tatsächlich verlassen willst, dann musst du zuerst einen neuen Administrator von der Liste der Teilnehmer ernennen. Nicht weil dies ein Schiff ist, sondern weil es die Datenbank des Servers vorschreibt...
it: Sei l'amministratore di questa convo. Nella tradizione marittima, il capitano affonda con la sua nave. Se vuoi davvero abbandonare questa convo, devi prima eleggere un nuovo amministratore dalla lista dei partecipanti. Non perché questa è una nave, ma perché la banca dati del server lo richiede...

# ChangeConvoAdminDialogMessage
source: Are you sure that you want to make the user "{0}" the new administrator of the convo "{1}"? Please be aware that you lose all admin rights after confirming this, and unless the new admin agrees, you can not revert this.
de: Bist du sicher, dass du den Benutzer "{0}" zum neuen Administrator der Unterhaltung "{1}" ernennen möchtest? Bitte bedenke, dass du bei erfolgter Bestätigung jegliche Administratorenrechte verlierst. Diese Änderung könnte daher nicht von dir alleine rückgängig gemacht werden.
it: Sei sicuro di voler rendere l'utente "{0}" il nuovo amministratore della conversazione "{1}"? Per favore ricordati che una volta confermata quest'azione, perderai ogni diritto amministrativo di questa convo. A meno che il nuovo admin sia consenziente, quest'azione non è reversibile da parte tua.

# ChangeConvoAdminDialogTitle
source: Change convo admin
de: Administrator ändern
it: Cambia amministratore

source: Convo created successfully
de: Unterhaltung erfolgreich erstellt
it: Convo creata

# ConvoMetadataChangeRequestMissingPassword
source: Please enter the convo's current password to authenticate your request!
de: Bitte gib das aktuelle Unterhaltungspasswort ein, um deine Handlung zu authentifizieren.
it: P.f. inserisci la password attuale della convo nel campo apposito per autentificare la tua richiesta.

# CopyUserIdToClipboard
source: Copy ID
de: ID Kopieren
it: Copia ID

source: Delete
de: Löschen
it: Conferma

# DeleteConvoButton
source: Destroy
de: Vernichten
it: Distruggi

# DeleteConvoConfirmationDialogMessage
source: Last warning! This is your last opportunity to prevent IMMEDIATE DELETION of the convo "{0}". This action CANNOT BE UNDONE!
de: Letzte Warnung! Dies ist deine letzte Möglichkeit, die SOFORTIGE ZERSTÖRUNG der Unterhaltung "{0}" zu verhindern. Diese Entscheidung KANN NICHT RÜCKGÄNGIG GEMACHT WERDEN!
it: Ultimo avvertimento! Questa è la tua ultima possibilità di prevenire all'IMMEDIATA DISTRUZIONE della conversazione "{0}". Questa decisione NON È REVERSIBILE!

# DeleteConvoConfirmationDialogTitle
source: Are you really sure?!
de: Bist du dir wirklich sicher?!
it: Sei davvero sicuro?!

# DeleteConvoDialogMessage
source: Are you sure that you want to delete the convo "{0}"? Be aware that by confirming the deletion, all participants are immediately denied access and the entire conversation including all of its content, metadata and messages are deleted IRREVERSIBLY!
de: Bist du sicher, dass du die Unterhaltung "{0}" löschen möchtest? Bedenke, dass bei bestätigter Löschung sämtliche Teilnehmer sofort den Zugang zur Unterhaltung verlieren würden. Der ganze Inhalt (inklusive Nachrichten) würde UNWIDERRUFLICH zerstört werden!
it: Sei sicuro di voler eliminare la conversazione "{0}"? Ricordati che confermandone l'eliminazione, tutti i partecipanti perdono immediatamente la possibilità di accedere alla convo e tutto il contenuto (inclusi i messaggi) vengono IRREVERSIBILMENTE distrutti!

# DeleteConvoDialogTitle
source: Delete convo
de: Unterhaltung löschen
it: Cancella convo

# DeletedConvoSuccessfully
source: Convo deleted
de: Unterhaltung gelöscht
it: Conversazione cancellata

source: Enter your message here...
de: Gib deine Nachricht hier ein...
it: Scrivi qui il tuo messaggio...

source: (EXPIRED)
de: (ABGELAUFEN)
it: (SCADUTA)

source: (EXPIRES SOON)
de: (LÄUFT BALD AB)
it: (SCADENZA IMMINENTE)

# KickAndBanButton
source: Kick and ban
de: Verbannen
it: Espelli e banna

# KickAndBanUserFromConvoDialogMessage
source: Are you sure that you want to kick the user "{0}" out from the convo "{1}"? He or she will be banned forever from this conversation, and this is IRREVERSIBLE!
de: Bist du sicher, dass du den Benutzer "{0}" aus der Unterhaltung "{1}" ausschliessen möchtest? Er oder sie würde für immer gesperrt, UNWIDERRUFLICH!
it: Sei sicuro di voler espellere e bannare l'utente "{0}" dalla convo "{1}"? Lui o lei verrebbe escluso dalla partecipazione PER SEMPRE, IRREVERSIBILMENTE!

# KickAndBanUserFromConvoDialogTitle
source: Kick and ban user
de: Teilnehmer verbannen
it: Espelli partecipante

# LeaveConvoButton
source: Leave convo
de: Verlassen
it: Esci da convo

# LeaveConvoDialogMessage
source: Are you sure that you want to leave the convo "{0}"?
de: Bist du sicher, dass du die Unterhaltung "{0}" verlassen möchtest?
it: Sei sicuro di voler abbandonare la conversazione "{0}"?

# LeaveConvoDialogTitle
source: Leave convo
de: Unterhaltung verlassen
it: Abbandona convo

source: Left convo successfully
de: Unterhaltung verlassen
it: Convo abbandonata

# LongPressedMessageTextDescription
source: Do you want to copy the message's text to the clipboard?
de: Möchtest du den Textinhalt der Nachricht in die Zwischenablage kopieren?
it: Vuoi copiare il contenuto (testo) del messaggio?

# LongPressedMessageTextTitle
source: Message text
de: Textnachricht
it: Messaggio

# MakeAdminButton
source: Make admin
de: Zum Admin befördern
it: Rendi amministratore

# MessageTooLargeFailureMessage
source: Your message couldn't be uploaded to the Epistle Web API because it exceeds the maximum file size limit.
de: Deine Nachricht konnte nicht an den Epistle Server übermittelt werden, weil sie die maximale Dateigrösse überschreitet.
it: Il tuo messaggio non è stato trasmesso al server di Epistle perché supera il limite di grandezza.

# MessageTooLargeFailureTitle
source: Message too large
de: Nachricht zu gross
it: Messaggio troppo grande

# MessageUploadFailureMessage
source: Your message couldn't be uploaded to the Epistle Web API!
de: Deine Nachricht konnte leider nicht an den Epistle Server übermittelt werden.
it: Non è stato possibile trasmettere il tuo messaggio al server di Epistle.

# MessageUploadFailureTitle
source: Message submission failure
de: Fehlschlag
it: Trasmissione messaggio fallita

# ParticipantContextMenuTitle
source: Convo participant options
de: Unterhaltungsteilnehmer Optionen
it: Partecipante convo

# ParticipantsListLabel
source: Participants (tap + hold for options):
de: Teilnehmer (gedrückt halten für Optionen):
it: Participanti (tieni premuto per opzioni):

# PleaseProvideConvoPassword
source: Please provide the convo's current password in order to authenticate your request!
de: Bitte gib das aktuelle Unterhaltungspasswort ein um deine Aktion zu authentifizieren!
it: P.f. autentifica la tua richiesta inserendo la password attuale della conversazione nel campo corrispondente.

source: User
de: Benutzer
it: Utente

# UserKickedOutFromConvoSuccessfully
source: User was kicked out
de: Nutzer wurde ausgeschlossen
it: Utente espulso

# AbortedDueToStoragePermissionDeclined
source: Cancelled due to rejected storage permission
de: Abgebrochen wegen abgelehntem Speicherzugriff
it: Annullato per via di permessi insufficienti

# StoragePermissionNeededForDownloadingAttachmentText
source: Glitched Epistle needs access to your device's storage in order to fulfill your request of downloading a message's attachment.
de: Glitched Epistle benötigt Zugriff auf den Speicher deines Geräts um den ausgewählten Anhang herunterzuladen.
it: Glitched Epistle necessita del tuo permesso di accedere alla memoria del tuo dispositivo per poter scaricare l'allegato desiderato.

# StoragePermissionNeededForDownloadingAttachmentTitle
source: Insufficient permissions
de: Fehlende Berechtigungen
it: Permessi insufficienti

# DownloadCompleteSuccessMessage
source: Downloaded to: {0}
de: Download erfolgreich: {0}
it: Download riuscito: {0}

# DownloadFailedErrorMessage
source: Download failed
de: Download fehlgeschlagen
it: Download fallito

# DownloadAttachmentDialogTitle
source: Download attachment
de: Anhang herunterladen
it: Scarica allegato

# FileAlreadyExistsDialogText
source: Do you want to overwrite the already existing file "{0}"?
de: Möchtest du die bereits vorhandene Datei "{0}" überschreiben?
it: Vuoi sovrascrivere il file già esistente "{0}"?

# FileAlreadyExistsDialogTitle
source: File already exists
de: Datei existiert bereits
it: File già esistente

# LoadingMessagesLabel
source: Decrypting messages...
de: Entschlüssle Nachrichten...
it: Caricamento messaggi...

# OpenAttachmentDialogText
source: Do you want to open the file "{0}"?
de: Möchtest du die Datei "{0}" öffnen?
it: Vuoi aprire il file "{0}"?

# OpenAttachmentDialogTitle
source: Open file
de: Datei öffnen
it: Apri file

# OpenAttachmentFailedErrorMessage
source: Error: couldn't open attachment...
de: Fehler: konnte Anhang nicht öffnen...

# ConfirmAttachmentUploadDialogText
source: Are you sure that you want to upload the file "{0}" to the convo?
de: Bist du sicher, dass du die Datei "{0}" an alle Unterhaltungsteilnehmer senden möchtest?

# ConfirmAttachmentUploadDialogTitle
source: Confirm upload
de: Upload bestätigen

# LoadPreviousMessagesButton
source: Load previous messages
de: Vorherige Nachrichten laden

# AbortedDueToMicrophonePermissionDeclined
source: Cancelled due to rejected microphone permission
de: Abgebrochen wegen abgelehntem Mikrofonzugriff

# MicrophonePermissionNeededForRecordingAudioAttachmentText
source: Glitched Epistle needs access to your device's microphone in order to fulfill your request of recording a new audio message.
de: Glitched Epistle benötigt Zugriff auf das Mikrofon deines Geräts um Sprachnachrichten aufnehmen zu können.

# MicrophonePermissionNeededForRecordingAudioAttachmentTitle
source: Insufficient permissions
de: Fehlende Berechtigungen

# AudioLoadFailedErrorMessageText
source: The specified audio attachment cannot be played back.
de: Die Sprachnachricht konnte leider nicht wiedergegeben werden.

# AudioLoadFailedErrorMessageTitle
source: Audio playback failed
de: Tonwiedergabe fehlgeschlagen

# ConvoMetadataTitleLabel
source: Convo Metadata
it: Metadata Convo

# KickAndBanUserDialogTitle
source: Kick user from convo
it: Escludi utente da convo
