Repository: GlitchedPolygons/GlitchedEpistle.Client.Mobile
Catalog: src/shared/Resources/LocalizedStrings.*.resx
Languages: de, it

# 2FA_Failure
source: Two-Factor Authentication failed!
de: Zwei-Faktor Authentifizierung fehlgeschlagen!
it: Autentificazione a due fattori fallita!

# AttemptingLoginButton
source: Attempting login...
de: Überprüfe...
it: Tento l'accesso...

# CancelButton
source: Cancel
de: Abbrechen
it: Annulla

# ChangeServerButton
source: Change Server
de: Server Wechseln
it: Cambia Server

# ConfigServerUrlSubLabel
source: You can connect to the official Epistle server for free or to a custom server.
de: Man kann sich mit dem offiziellen Epistle Server kostenlos verbinden oder auch mit fremden Third-Party Server.
it: Puoi collegarti al server ufficiale di Epistle gratuitamente oppure ad un server terzo.

# ConfigServerUrlTitleLabel
source: Please connect to the Epistle server.
de: Mit einem Epistle Server verbinden.
it: P.f. collegarsi ad un server Epistle.

# ConnectButton
source: Connect
de: Verbindung übernehmen
it: Conferma

# ConnectionToServerFailed
source: The connection to the specified Epistle server could not be established.
de: Die Verbindung zum gewählten Epistle Server konnte nicht hergestellt werden.
it: Tentativo di connessione al server specificato fallito.

# ConnectionToServerFailedErrorMsg
source: Could not connect to the Epistle server. Please make sure to have a working, active internet connection and double check the server url!
de: Verbindung mit dem Epistle Server fehlgeschlagen. Bitte sicherstellen, dass eine aktive und stabile Internetverbindung vorhanden ist. Ausserdem überprüfen, ob die Server URL richtig ist.
it: Connessione col server di Epistle fallita. P.f. assicurarsi di avere una connessione internet stabile e funzionante, e che l'indirizzo del server sia corretto.

source: Copied...
de: Kopiert...
it: Copiato...

source: Copy
de: Kopieren
it: Copia

# DoNotTellSecretToAnyone
source: Do not tell this secret code to anyone!
de: Verrate niemandem diesen Code!
it: Non dire questo codice a nessuno!

source: Error
de: Fehler
it: Errore

# ExportBackupCodesButton
source: Export backup codes
de: Notfall-Codes exportieren
it: Esporta codici d'emergenza

# GeneratingKeysLabel
source: Generating 4096-bit RSA Key Pair...
de: Generiere 4096-bit RSA Schlüssel...
it: Generazione chiavi 4096-bit RSA...

# GoogleAuthRecommendedLabel
source: (Google Authenticator is recommended)
de: (Google Authenticator ist empfehlenswert)
it: (Preferibilmente Google Authenticator)

# HereAreYourBackupCodes
source: Here are your two-factor authentication emergency backup codes. Store these somewhere safe (possibly disconnected from the internet) and DO NOT SHARE them with anybody!
de: Dies sind deine Notfall Backup-Codes für die Zwei-Faktor Authentifizierung. Speichere sie irgendwo in Sicherheit ab (am besten offline) und TEILE SIE NIEMANDEM MIT!
it: Eccoti qua i tuoi codici d'emergenza per l'autentificazione a due fattori. Salvateli da qualche parte al sicuro, possibilmente disconnesso da internet e NON CONDIVIDERLI con nessuno!

# KeyGenerationFailed
source: There was an unexpected error whilst generating the RSA key pair (during user creation process).
de: Es ist ein unerwarteter Fehler aufgetreten während der Generierung der 4096-bit RSA Schlüssel.
it: Si è verificato un errore durante la generazione della chiave RSA 4096-bit.

# LoginButton
source: Login
de: Einloggen
it: Accedi

# PasswordConfirmationLabel
source: Re-enter your password
de: Passwort bestätigen
it: Conferma password

# PasswordLabel
source: Password
de: Passwort

# PleaseBackup2FASecret
source: This is your two-factor authentication secret. Back it up somewhere safe, because you'll need it if you lose your 2FA device.
de: Dies ist dein Zwei-Faktor Authentifizierungsgeheimnis. Schreib es dir auf und hinterlege es irgendwo wo's sicher ist: du wirst es brauchen falls du dein Authentifizierungsgerät verlierst!
it: Questo è il tuo segreto d'autentificazione a due fattori. Scrivilo giù e nascondilo da qualche parte al sicuro: ti servirà qual ora dovessi perdere il tuo dispositivo d'autentificazione.

# PleaseEnterUsernameDialogTextLabel
source: Messages will be sent using this name. This can be anything, but it's recommended to keep the same username as long as possible for other convo participants to easily identify you.
de: Deine Nachrichten werden mit diesem Namen unterschrieben. Du darfst ihn frei wählen und ändern nach belieben, aber denke daran: je weniger oft du ihn änderst desto einfacher können deine Empfänger dich identifizieren.
it: I tuoi messaggi verranno firmati con questo nome. Puoi sceglierlo e cambiarlo liberamente, ma ricordati che è consigliato mantenerlo costante il più possibile una volta scelto, così che gli altri ti possono identificare più facilmente.

# PleaseEnterUsernameDialogTitleLabel
source: Please enter a username
de: Benutzername definieren
it: Scegli un nome utente

# PleaseLoginLabel
source: Please login:
de: Hier unten einloggen:
it: Accedi ora:

# PleaseRegisterLabel
source: Create your user account here:
de: Erstelle hier ein neues Benutzerkonto:
it: Crea ora il tuo account:

# PleaseSetUp2FALabel
source: Please set up your 2FA authenticator app.
de: Bitte Zwei-Faktor Authentifizierung jetzt konfigurieren.
it: P.f. configura ora la tua autentificazione a due fattori.

# PleaseVerify2FA
source: Please enter your 2FA code for verification:
de: Bitte bestätige deinen Zwei-Faktor Authentifizierungstoken hier unten:
it: Per favore verifica il tuo token d'autentificazione a due fattori:

# RegisterButton
source: Register
de: Registrieren
it: Registrati

# ResetButton
source: Reset
de: Zurücksetzen
it: Ripristina

# TestConnectionButton
source: Test connection
de: Verbindung testen
it: Prova connessione

# TotpLabel
source: Two-Factor Authentication
de: Zwei-Faktor Authentifizierung
it: Autentificazione a due fattori

# UserCreationFailedClientSideButSucceededServerSide
source: The user creation succeeded server-side but there was an unexpected client-side error whilst handling the user creation server response.
de: Der Nutzer konnte erfolgreich erstellt werden auf dem Server, allerdings ist ein unerwarteter Fehler lokal (Client-side) aufgetreten.
it: La creazione dell'utente è avvenuta con successo sul server, ma purtroppo è fallita localmente.

# UserCreationFailedServerSide
source: The user creation process failed server-side. Please double check the server URL and make sure that the user creation secret is correct!
de: Nutzerregistrierung fehlgeschlagen: bitte sicherstellen, dass die Server URL korrekt ist und das Nutzererstellungspasswort stimmt!
it: La creazione dell'utente è fallita: verificare che l'indirizzo e segreto del server sono validi.

# UserCreationSecretLabel
source: User creation secret
de: Nutzererstellungspasswort
it: Segreto del server

# UserIdLabel
source: User ID
de: Nutzer ID
it: ID utente

# UsernameLabel
source: Username
de: Benutzername
it: Nome utente

source: Verify
de: Verifizieren
it: Verifica

# WelcomeLabel
source: Welcome to Glitched Epistle.
de: Willkommen bei Glitched Epistle.
it: Benvenuto su Glitched Epistle.

# ConvoListEntryExpirationLabel
source: (Remaining days: {0})
de: (Verbleibende Tage: {0})
it: (Giorni rimanenti: {0})

# MasterMenuItemChangePassword
source: Change password
de: Passwort ändern
it: Cambia password

# MasterMenuItemLogout
source: Logout
de: Ausloggen

# MasterMenuItemConvos
source: Convos
de: Unterhaltungen
it: Conversazioni

# MasterMenuItemSettings
source: Settings
de: Einstellungen
it: Impostazioni

# PleaseEnterGoodUsernameLabel
source: Hint: A good username is short, catchy and one that makes you easily recognizable by other convo participants.
de: Tipp: Ein guter Nutzername ist in der Regel kurz und knackig, wodurch man dich innerhalb einer Unterhaltung leichter identifizeren kann.
it: N.B.: Un buon nome utente è solitamente breve e conciso, in grado di renderti facilmente identificabile come mittente.

source: Are you sure?
de: Bist du sicher?
it: Sei sicuro?

source: No
de: Nein

# RevertButton
source: Revert
de: Zurücksetzen
it: Ripristina

# SaveButton
source: Save
de: Speichern
it: Salva

source: Yes
de: Ja
it: Sì

# SettingsAutoSaveReminder
source: These settings don't require manual saving (they're saved automatically as you're editing them). Reverting to default settings will also apply them immediately. Are you sure that you want this?
de: Diese Einstellungen benötigen keine manuelle Speicherung (sie werden laufend gespeichert während der Bearbeitung). Zurücksetzen würde die Werkseinstellungen direkt übernehmen. Bist du dir sicher, dass du das willst?
it: Queste impostazioni non richiedono il salvataggio manuale (vengono salvate automaticamente in diretta mentre le modifichi). Ripristinare i valori originali è irreversibile, sei sicuro di procedere?

# ThemeLabel
source: Theme
de: Design
it: Design

# AboutButton
source: About
de: Info
it: Info

# CloseButton
source: Close
de: Schliessen
it: Chiudi

# DarkTheme
source: Dark
de: Dunkel
it: Scuro

source: Dismiss
de: Schliessen
it: Chiudi

source: English
de: Englisch
it: Inglese

source: German
de: Deutsch
it: Tedesco

source: Italian
de: Italienisch
it: Italiano

# LanguageLabel
source: Language
de: Sprache
it: Lingua

# LightTheme
source: Light
de: Hell
it: Chiaro

source: Save convo passwords
de: Unterhaltungspasswörter speichern
it: Salva password delle conversazioni

source: Swiss German
de: Schweizerdeutsch
it: Svizzero tedesco

# ReplaceTotpWithFingerprint
source: Replace two-factor authentication with fingerprint
de: Fingerabdruck anstatt 2-Faktor Authentifizierung
it: Usa impronta digitale al posto dell'autentificazione a due fattori

source: Save user password
de: Login Passwort speichern
it: Salva password dell'utente

# LanguageChangeRestartRequiredLabel
source: Changing the language setting requires the Epistle app to be restarted in order for the modification to take effect!
de: Eine Änderung an der Spracheinstellung benötigt einen App-Neustart um in Kraft zu treten!
it: La modifica dell'impostazione di lingua necessita di un riavvio dell'applicazione per applicare il cambiamento!

source: Activation successful
de: Erfolgreich aktiviert
it: Attivazione riuscita

source: Cancelled...
de: Abgebrochen...
it: Azione annullata...

# ChangePasswordDescriptionLabel
source: It's very easy, and important that you do it every now and then! To change your password, enter your current one in the field below and then double-enter your new desired password right after. Authenticate your request by entering your Two-Factor Authentication token and voilà, you're done! Password changed, safely and swiftly. Good passwords are at least 8 characters long and contain some degree of special symbols, numbers and mixed uppercase and lowercase letters.
de: Es ist super leicht, und sollte ab und zu gemacht werden! Um dein Passwort zu ändern, gib dein aktuelles Passwort hier unten ein und dann dein neues gewünschtes Passwort unmittelbar darunter, bestätige dies durch erneutes Eingeben und dann nur noch deine Anfrage authentifizeren mit deinem 2FA Token und voilà! Passwort geändert, sicher und schnell! Gute Passwörter sind mindestens 8 Zeichen lang und beinhalten ein oder mehrere Sonderzeichen, sowie Gross- und Kleinbuchstaben.
it: È davvero facilissimo, ed è importante che venga fatto ogni tanto! Per cambiare la tua password, immetti la tua password attuale nel campo qua sotto, poi immetti doppiamente la tua nuova password desiderata subito dopo e autentifica la tua richiesta con il tuo token d'autentificazione a due fattori e voilà! Password cambiata, rapidamente e in modo sicuro. Password decenti contengono come minimo 8 caratteri, alcuni simboli speciali, numeri e lettere miste (maiuscole e minuscole).

# ChangePasswordTitleLabel
source: Changing your password
de: Passwort ändern
it: Modifica password

# CurrentPasswordLabel
source: Current password
de: Aktuelles Passwort
it: Password attuale

# InvalidUserIdPwOrTOTP
source: Error! Invalid user id, password or 2FA.
de: Fehler! Nutzer-ID, Passwort oder Zwei-Faktor Authentifizierungstoken ungültig.
it: Errore! ID utente, password o token d'autentificazione a due fattori invalido.

# LoginFailedClientSide
source: Unexpected ERROR! Login succeeded server-side, but the returned response couldn't be handled properly (probably key decryption failure).
de: Unerwarteter FEHLER! Der Anmeldeversuch war auf dem Server erfolgreich, konnte jedoch lokal nicht weiterverarbeitet werden (wahrscheinlich ein Problem mit der Entzifferung der retournierten Schlüssel).
it: ERRORE imprevisto! Il login è riuscito dal lato del server, ma la risposta non è potuta essere maneggiata correttamente (probabilmente un problema con la decrittazione delle chiavi).

# LoginMultiFailedAttemptsErrorMessage
source: Note that if your credentials are correct but login fails nonetheless, it might be that you're locked out due to too many failed attempts and/or expired (or already used) two-factor authentication tokens! Please try again in 15 minutes.
de: Bedenke dass wenn deine Login-Daten korrekt sind und deine Anmeldung dennoch fehlschlägt, kann es sein, dass es daran liegt dass du dich aus deinem Konto rausgesperrt hast durch zu viele Fehlversuche und/oder abgelaufene (oder bereits benutzte) zwei-Faktor Authentifizierungstoken. Bitte versuche es in 15 Minuten nochmal!
it: Ricordati che se le tue credenziali d'accesso sono corrette ma il login fallisce ciò nonostante, potrebbe essere che ti sei chiuso fuori dal tuo account per via di troppi tentativi falliti e/o token d'autentificazione a due fattori scaduto (o già obliterato). P.f. riprova ancora tra 15 minuti!

# NewPasswordConfirmationLabel
source: Re-enter your new password
de: Neues Passwort bestätigen
it: Conferma password nuova

# NewPasswordLabel
source: New password
de: Neues Passwort
it: Password nuova

# NoTotpProvidedErrorMessage
source: No 2FA token provided - please authenticate your request!
de: Kein Zwei-Faktor Authentifizierungs-Token eingegeben - bitte authentifiziere deine Anfrage!
it: Token d'autentificazione a due fattori vuoto - p.f. autentifica la tua richiesta!

source: Password changed successfully
de: Passwort erfolgreich geändert
it: Password cambiata

# PasswordChangeRequestFailedServerSideErrorMessage
source: Password change request failed: please double-check all fields and try again!
de: Passwort Änderungsversuch fehlgeschlagen: evtl. ungültiger Zwei-Faktor Auth. Token?
it: Richiesta di cambiamento password fallita: p.f. controlla la validità di tutti i campi!

# PasswordFieldsInvalid
source: The password fields are empty or don't match where they need to match.
de: Ein oder mehrere Passwortfelder sind leer oder nicht übereinstimmend.
it: Uno o più campi sono vuoti e/o non combaciano dove devono combaciare.

# PasswordTooWeakErrorMessage
source: Your password is too weak; make sure that it has at least >{0} characters!
de: Das eingegebene Passwort ist zu schwach; es sollte mindestens >{0} Zeichen beinhalten!
it: La password inserita è troppo debole; dovrebbe contenere come minimo >{0} caratteri!

# PleaseEnterTotpSecretDialogTextLabel
source: In order for the Epistle app to generate 2FA tokens for you, it needs to know your Two-Factor Authentication secret that you received when you first created this account (when the page with the QR-Code was displayed). No worries: it will be stored in encrypted form using your device's SecureStorage provider. If you feel unsure about this and/or want to keep the token generation source away from the client app (which is what 2FA is actually all about), you don't need to enable this. This feature is here for pure comfort reasons only! Please note that if you do not know or have forgot your 2FA secret, you're out of luck and you cannot enable this option. Just make sure not to lose your 2FA device... take care!
de: Damit die Epistle App Zwei-Faktor Authentifizierungs-Tokens für dich generieren kann, muss das 2FA-Geheimnis bereitgestellt werden, welches du bei der Registrierung deines Kontos angezeigt bekamst (die Seite mit dem QR-Code). Keine Sorge: dieses Geheimnis bleibt geheim. Es wird sorgfältig verschlüsselt und im SecureStorage Provider deines Gerätes gelagert. Wenn du dir dies bezüglich unsicher bist, dich unwohl dabei fühlst und/oder deine Token-Generierungsquelle einfach von der konsumierenden Client-App trennen willst (was ja ursprünglich der Sinn und Zweck der Zwei-Faktor Authentifizierung war), musst du dies nicht tun. Diese Einstellung ist zu 100% optional und wurde rein aus Bequemlichkeitsgründen implementiert! Bitte beachte, dass wenn du nicht mehr im Besitz deines 2FA-Geheimnis bist, diese Einstellung nicht aktiviert werden kann. In diesem Fall, sorge bitte einfach dafür, dass du dein 2FA-Gerät nicht auch noch verlierst...
it: Per poter generarti dei token di autentificazione a due fattori, Epistle necessita di sapere il tuo segreto 2FA, il quale ti è stato mostrato durante il processo di registrazione del tuo account (la pagina col codice QR). Tranquillo: verrà encrittato e salvato mediante il provider di SecureStorage nativo del tuo dispositivo. Se ti senti insicuro riguardo a questo e/o semplicemente desideri mantenere il tuo account dell'applicazione separato dal suo secondo fattore d'autentificazione (il che era originalmente l'idea e lo scopo ultimativo del 2FA) non dovresti attivare questa opzione. Nessuno ti forza; questa opzione è 100% facoltativa ed è stata implementata soltanto per motivi di comodità. Nota bene che se non sei più in possesso del tuo segreto 2FA, purtroppo non c'è niente da fare e non puoi attivare questa impostazione. In questo caso p.f. assicurati che non perdi anche il tuo dispositivo attualmente in grado di generare token...

# PleaseEnterTotpSecretDialogTitleLabel
source: Please enter your 2FA Secret
de: Bitte das 2FA-Geheimnis eingeben
it: P.f. immetti segreto 2FA

source: Save TOTP secret
de: Zwei-Faktor Auth. Geheimnis speichern
it: Salva segreto di autentificazione a due fattori

# SubmitPwChangeRequestButton
source: Submit
de: Passwort ändern
it: Conferma

# TwoFactorAuthTokenVerificationFailed
source: 2FA verification failed...
de: Zwei-Faktor Authentifizierung fehlgeschlagen
it: Autentificazione non riuscita...

source: Use fingerprint
de: Fingerabdruck benutzen
it: Utilizza impronta digitale

# ConvoIdLabel
source: Convo ID
de: Unterhaltungs-Identitätsnummer
it: Numero d'identificazione

# EmptyConvoIdFieldErrorMessage
source: The convo id field is empty.
de: Das Feld "Unterhaltungs-ID" ist leer.
it: Il campo della convo id è vuoto.

# EmptyPasswordFieldErrorMessage
source: The password field is empty.
de: Das Passwortfeld ist leer.
it: Il campo della password è vuoto.

# JoinConvoButton
source: Join
de: Beitreten
it: Partecipa

# JoinConvoDescriptionLabel
source: To join a convo, you need its unique id and password. The convo administrator (or one of the participants) should have given you these credentials over a secure communication channel.
de: Um einer Unterhaltung beizutreten, benötigst du das Unterhaltungspasswort sowie Identitätsnummer. Der Unterhaltungs-Administrator (oder einer der Teilnehmer) sollte dir diese NUR über einen sicheren Kommunikationskanal gegeben haben.
it: Per partecipare ad una conversazione, necessiti della sua id e password. L'amministratore della convo (o uno dei partecipanti) ti dovrebbe aver dato le credenziali d'accesso attraverso un canale di comunicazione sicuro.

# JoinConvoFailedErrorMessage
source: Couldn't join convo. Please double check the credentials and try again. If that's not the problem, then the convo might have expired, deleted or you've been kicked out of it.
de: Beitritt fehlgeschlagen. Bitte überprüfe nochmal deine Zugangsdaten und probiere es erneut. Falls das nicht das Problem ist, kann es sein, dass die Unterhaltung ihr Ablaufdatum erreicht hat, gelöscht wurde oder du vom Administrator ausgeschlossen wurdest.
it: Connessione alla conversazione fallita. P.f. ricontrolla i dati d'accesso e riprova ancora. Se non è quello il problema allora potrebbe essere che la convo è semplicemente stata cancellata, ha raggiunto la sua data di scadenza oppure sei stato espulso da parte dell'amministratore.

# JoinConvoTitleLabel
source: Join Convo
de: Unterhaltung beitreten
it: Partecipa a conversazione

# AutoCopyIdAfterSuccessfulConvoCreation
source: Copy convo id to clipboard after creation
de: Unterhaltungs-ID kopieren nach Erstellung
it: Copia id convo dopo creazione riuscita

# ConvoCreationFailedErrorMessage
source: Convo "{0}" couldn't be created. Perhaps due to unsuccessful Two-Factor Authentication: please double check the provided 2FA token and try again.
de: Unterhaltung "{0}" konnte nicht erstellt werden. Evtl. aufgrund ungültiger Zwei-Faktor Authentifizierung: bitte überprüfe das eingegebene 2FA Token und probiere es erneut.
it: Creazione della convo "{0}" non riuscita. Eventualmente per via di un'autentificazione a due fattori fallita: p.f. ricontrolla il token 2FA inserito e riprova tra un paio di secondi.

# ConvoDescriptionLabel
source: Description
de: Beschreibung
it: Descrizione

# ConvoMetadataChangedSuccessfully
source: Changes applied
de: Änderungen übernommen
it: Modifiche applicate

# ConvoMetadataChangeRequestRejected
source: Convo metadata change request was rejected. Perhaps you provided the wrong password or invalid data? Please double check the form.
de: Metadata Änderungsversuch fehlgechlagen. Bitte das Formular überprüfen und sicherstellen, dass alle Felder gültige Daten beinhalten.
it: Richiesta di modifica metadata della convo respinta. P.f. ricontrollare il formulario e accertarsi che tutti i dati sono validi.

# ConvoTitleLabel
source: Title
de: Titel
it: Titolo

# CreateConvoButton
source: Create
de: Erstellen
it: Crea

# CreateConvoDescriptionLabel
source: Create a new conversation to which other Epistle users can connect to. After the convo's expiration date, it will be irreversably purged from the server, deleting all traces. Other users need the convo's unique id and its password in order to connect to it, please remember to provide them with this information over a secure communication channel.
de: Erstelle eine neue Unterhaltung welcher andere Epistle Nutzer beitreten können. Nach dem Ablaufultimatum wird die gesamte Unterhaltung unwiderruflich vom Server gelöscht. Andere Nutzer benötigen die Unterhaltungs-ID sowie Passwort um sich zu verbinden, bitte achte also darauf, dass du deinen gewünschten Teilnehmern diese Informationen nur über einen sicheren Kommunikationskanal mitteilst.
it: Crea ora una nuova conversazione alla quale altri utenti Epistle si possono connettere. Dopo la data di scadenza, la conversazione verrà interamente e irreversibilmente cancellata dal server, distruggendone ogni traccia. Altri utenti necessitano della convo id e password per partecipare, ricordati quindi di provvedere queste informazioni sensibili ai tuoi partecipanti desiderati soltanto attraverso un canale di comunicazione sicuro.

# CreateConvoTitleLabel
source: Create Convo
de: Neue Unterhaltung erstellen
it: Crea nuova conversazione

# EmptyConvoTitleFieldErrorMessage
source: Convo title field is empty, please give your conversation a descriptive name for others to recognize!
de: Das Feld "Titel" ist leer; bitte gib deiner neuen Unterhaltung einen Namen.
it: Il campo "titolo" è vuoto; p.f. dai un nome descrittivo e facilmente memorizzabile alla tua nuova conversazione!

# ExpirationLabel
source: Expiration:
de: Ablaufdatum:
it: Scadenza:

# PasswordsDontMatchErrorMessage
source: The two entered passwords don't match.
de: Die zwei eingegeben Passwörter stimmen nicht überein.
it: Le due password inserite non coincidono.
